Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering
menu.ChipVariant=Chip Variant

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.LORA_FEM_TYPE=LoRa FEM Type
menu.LORA_RX_LNA=LoRa External FEM Receive Gain
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
menu.DisplayModel=Display Model

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################
heltec_wifi_kit_32.name=Heltec WiFi Kit 32

heltec_wifi_kit_32.bootloader.tool=esptool_py
heltec_wifi_kit_32.bootloader.tool.default=esptool_py

heltec_wifi_kit_32.upload.tool=esptool_py
heltec_wifi_kit_32.upload.tool.default=esptool_py
heltec_wifi_kit_32.upload.tool.network=esp_ota

heltec_wifi_kit_32.upload.maximum_size=1310720
heltec_wifi_kit_32.upload.maximum_data_size=327680
heltec_wifi_kit_32.upload.flags=
heltec_wifi_kit_32.upload.extra_flags=

heltec_wifi_kit_32.serial.disableDTR=true
heltec_wifi_kit_32.serial.disableRTS=true

heltec_wifi_kit_32.build.tarch=xtensa
heltec_wifi_kit_32.build.bootloader_addr=0x1000
heltec_wifi_kit_32.build.target=esp32
heltec_wifi_kit_32.build.mcu=esp32
heltec_wifi_kit_32.build.core=esp32
heltec_wifi_kit_32.build.variant=heltec_wifi_kit_32
heltec_wifi_kit_32.build.board=HELTEC_WIFI_KIT_32

heltec_wifi_kit_32.build.f_cpu=240000000L
heltec_wifi_kit_32.build.flash_size=4MB
heltec_wifi_kit_32.build.flash_freq=80m
heltec_wifi_kit_32.build.flash_mode=dio
heltec_wifi_kit_32.build.boot=dio
heltec_wifi_kit_32.build.partitions=default
heltec_wifi_kit_32.build.defines=
heltec_wifi_kit_32.build.band=LoRaWAN_NONE
heltec_wifi_kit_32.build.LoRaWanDebugLevel=0

heltec_wifi_kit_32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
heltec_wifi_kit_32.menu.PartitionScheme.default.build.partitions=default
heltec_wifi_kit_32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
heltec_wifi_kit_32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
heltec_wifi_kit_32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_wifi_kit_32.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_wifi_kit_32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_wifi_kit_32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_wifi_kit_32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_wifi_kit_32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_wifi_kit_32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_wifi_kit_32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_wifi_kit_32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_wifi_kit_32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_wifi_kit_32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_wifi_kit_32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
heltec_wifi_kit_32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_wifi_kit_32.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_wifi_kit_32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

heltec_wifi_kit_32.menu.CPUFreq.240=240MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_kit_32.menu.CPUFreq.160=160MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_kit_32.menu.CPUFreq.80=80MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.80.build.f_cpu=80000000L

heltec_wifi_kit_32.menu.UploadSpeed.921600=921600
heltec_wifi_kit_32.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_kit_32.menu.UploadSpeed.115200=115200
heltec_wifi_kit_32.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_kit_32.menu.UploadSpeed.256000.windows=256000
heltec_wifi_kit_32.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400=230400
heltec_wifi_kit_32.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_kit_32.menu.UploadSpeed.460800.linux=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_kit_32.menu.UploadSpeed.512000.windows=512000
heltec_wifi_kit_32.menu.UploadSpeed.512000.upload.speed=512000

heltec_wifi_kit_32.menu.DebugLevel.none=None
heltec_wifi_kit_32.menu.DebugLevel.none.build.code_debug=0
heltec_wifi_kit_32.menu.DebugLevel.error=Error
heltec_wifi_kit_32.menu.DebugLevel.error.build.code_debug=1
heltec_wifi_kit_32.menu.DebugLevel.warn=Warn
heltec_wifi_kit_32.menu.DebugLevel.warn.build.code_debug=2
heltec_wifi_kit_32.menu.DebugLevel.info=Info
heltec_wifi_kit_32.menu.DebugLevel.info.build.code_debug=3
heltec_wifi_kit_32.menu.DebugLevel.debug=Debug
heltec_wifi_kit_32.menu.DebugLevel.debug.build.code_debug=4
heltec_wifi_kit_32.menu.DebugLevel.verbose=Verbose
heltec_wifi_kit_32.menu.DebugLevel.verbose.build.code_debug=5

heltec_wifi_kit_32.menu.EraseFlash.none=Disabled
heltec_wifi_kit_32.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_kit_32.menu.EraseFlash.all=Enabled
heltec_wifi_kit_32.menu.EraseFlash.all.upload.erase_cmd=-e

