Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wireless_tracker_v2.menu.FlashMode.qio=QIO 80MHz
heltec_wireless_tracker_v2.menu.FlashMode.qio.build.flash_mode=dio
heltec_wireless_tracker_v2.menu.FlashMode.qio.build.boot=qio
heltec_wireless_tracker_v2.menu.FlashMode.qio.build.boot_freq=80m
heltec_wireless_tracker_v2.menu.FlashMode.qio.build.flash_freq=80m
heltec_wireless_tracker_v2.menu.FlashMode.qio120=QIO 120MHz
heltec_wireless_tracker_v2.menu.FlashMode.qio120.build.flash_mode=dio
heltec_wireless_tracker_v2.menu.FlashMode.qio120.build.boot=qio
heltec_wireless_tracker_v2.menu.FlashMode.qio120.build.boot_freq=120m
heltec_wireless_tracker_v2.menu.FlashMode.qio120.build.flash_freq=80m
heltec_wireless_tracker_v2.menu.FlashMode.dio=DIO 80MHz
heltec_wireless_tracker_v2.menu.FlashMode.dio.build.flash_mode=dio
heltec_wireless_tracker_v2.menu.FlashMode.dio.build.boot=dio
heltec_wireless_tracker_v2.menu.FlashMode.dio.build.boot_freq=80m
heltec_wireless_tracker_v2.menu.FlashMode.dio.build.flash_freq=80m

heltec_wireless_tracker_v2.menu.FlashSize.8M=8MB (64Mb)
heltec_wireless_tracker_v2.menu.FlashSize.8M.build.flash_size=8MB

heltec_wireless_tracker_v2.menu.LoopCore.1=Core 1
heltec_wireless_tracker_v2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_wireless_tracker_v2.menu.LoopCore.0=Core 0
heltec_wireless_tracker_v2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_wireless_tracker_v2.menu.EventsCore.1=Core 1
heltec_wireless_tracker_v2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wireless_tracker_v2.menu.EventsCore.0=Core 0
heltec_wireless_tracker_v2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wireless_tracker_v2.menu.USBMode.hwcdc=Hardware CDC and JTAG
heltec_wireless_tracker_v2.menu.USBMode.hwcdc.build.usb_mode=1
heltec_wireless_tracker_v2.menu.USBMode.default=USB-OTG (TinyUSB)
heltec_wireless_tracker_v2.menu.USBMode.default.build.usb_mode=0

heltec_wireless_tracker_v2.menu.CDCOnBoot.default=Disabled
heltec_wireless_tracker_v2.menu.CDCOnBoot.default.build.cdc_on_boot=0
heltec_wireless_tracker_v2.menu.CDCOnBoot.cdc=Enabled
heltec_wireless_tracker_v2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

heltec_wireless_tracker_v2.menu.MSCOnBoot.default=Disabled
heltec_wireless_tracker_v2.menu.MSCOnBoot.default.build.msc_on_boot=0
heltec_wireless_tracker_v2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
heltec_wireless_tracker_v2.menu.MSCOnBoot.msc.build.msc_on_boot=1

heltec_wireless_tracker_v2.menu.DFUOnBoot.default=Disabled
heltec_wireless_tracker_v2.menu.DFUOnBoot.default.build.dfu_on_boot=0
heltec_wireless_tracker_v2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
heltec_wireless_tracker_v2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

heltec_wireless_tracker_v2.menu.UploadMode.default=UART0 / Hardware CDC
heltec_wireless_tracker_v2.menu.UploadMode.default.upload.use_1200bps_touch=false
heltec_wireless_tracker_v2.menu.UploadMode.default.upload.wait_for_upload_port=false
heltec_wireless_tracker_v2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
heltec_wireless_tracker_v2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
heltec_wireless_tracker_v2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

heltec_wireless_tracker_v2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
heltec_wireless_tracker_v2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
heltec_wireless_tracker_v2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.minimal.build.partitions=minimal
heltec_wireless_tracker_v2.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
heltec_wireless_tracker_v2.menu.PartitionScheme.no_fs.build.partitions=no_fs
heltec_wireless_tracker_v2.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
heltec_wireless_tracker_v2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_wireless_tracker_v2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_wireless_tracker_v2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
heltec_wireless_tracker_v2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_wireless_tracker_v2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
heltec_wireless_tracker_v2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
heltec_wireless_tracker_v2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
heltec_wireless_tracker_v2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker=RainMaker 4MB
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
heltec_wireless_tracker_v2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
heltec_wireless_tracker_v2.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
heltec_wireless_tracker_v2.menu.PartitionScheme.custom=Custom
heltec_wireless_tracker_v2.menu.PartitionScheme.custom.build.partitions=
heltec_wireless_tracker_v2.menu.PartitionScheme.custom.upload.maximum_size=8388608

heltec_wireless_tracker_v2.menu.CPUFreq.240=240MHz (WiFi)
heltec_wireless_tracker_v2.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wireless_tracker_v2.menu.CPUFreq.160=160MHz (WiFi)
heltec_wireless_tracker_v2.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wireless_tracker_v2.menu.CPUFreq.80=80MHz (WiFi)
heltec_wireless_tracker_v2.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wireless_tracker_v2.menu.CPUFreq.40=40MHz
heltec_wireless_tracker_v2.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wireless_tracker_v2.menu.CPUFreq.20=20MHz
heltec_wireless_tracker_v2.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wireless_tracker_v2.menu.CPUFreq.10=10MHz
heltec_wireless_tracker_v2.menu.CPUFreq.10.build.f_cpu=10000000L

