Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wifi_lora_32_V4_R8.menu.EventsCore.1=Core 1
heltec_wifi_lora_32_V4_R8.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wifi_lora_32_V4_R8.menu.EventsCore.0=Core 0
heltec_wifi_lora_32_V4_R8.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wifi_lora_32_V4_R8.menu.USBMode.hwcdc=Hardware CDC and JTAG
heltec_wifi_lora_32_V4_R8.menu.USBMode.hwcdc.build.usb_mode=1
heltec_wifi_lora_32_V4_R8.menu.USBMode.default=USB-OTG (TinyUSB)
heltec_wifi_lora_32_V4_R8.menu.USBMode.default.build.usb_mode=0

heltec_wifi_lora_32_V4_R8.menu.CDCOnBoot.default=Enabled
heltec_wifi_lora_32_V4_R8.menu.CDCOnBoot.default.build.cdc_on_boot=1
heltec_wifi_lora_32_V4_R8.menu.CDCOnBoot.cdc=Disabled
heltec_wifi_lora_32_V4_R8.menu.CDCOnBoot.cdc.build.cdc_on_boot=0
heltec_wifi_lora_32_V4_R8.menu.MSCOnBoot.default=Disabled
heltec_wifi_lora_32_V4_R8.menu.MSCOnBoot.default.build.msc_on_boot=0
heltec_wifi_lora_32_V4_R8.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
heltec_wifi_lora_32_V4_R8.menu.MSCOnBoot.msc.build.msc_on_boot=1

heltec_wifi_lora_32_V4_R8.menu.DFUOnBoot.default=Disabled
heltec_wifi_lora_32_V4_R8.menu.DFUOnBoot.default.build.dfu_on_boot=0
heltec_wifi_lora_32_V4_R8.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
heltec_wifi_lora_32_V4_R8.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

heltec_wifi_lora_32_V4_R8.menu.UploadMode.default=UART0 / Hardware CDC
heltec_wifi_lora_32_V4_R8.menu.UploadMode.default.upload.use_1200bps_touch=false
heltec_wifi_lora_32_V4_R8.menu.UploadMode.default.upload.wait_for_upload_port=false
heltec_wifi_lora_32_V4_R8.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
heltec_wifi_lora_32_V4_R8.menu.UploadMode.cdc.upload.use_1200bps_touch=true
heltec_wifi_lora_32_V4_R8.menu.UploadMode.cdc.upload.wait_for_upload_port=true

heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.default.build.partitions=default
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.minimal.build.partitions=minimal
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_fs.build.partitions=no_fs
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.fatflash.build.partitions=ffat
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker=RainMaker 4MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.custom=Custom
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.custom.build.partitions=
heltec_wifi_lora_32_V4_R8.menu.PartitionScheme.custom.upload.maximum_size=16777216

heltec_wifi_lora_32_V4_R8.menu.CPUFreq.240=240MHz (WiFi)
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.160=160MHz (WiFi)
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.80=80MHz (WiFi)
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.40=40MHz
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.20=20MHz
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.10=10MHz
heltec_wifi_lora_32_V4_R8.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.921600=921600
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.115200=115200
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.256000.windows=256000
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.230400=230400
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.460800.linux=460800
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.512000.windows=512000
heltec_wifi_lora_32_V4_R8.menu.UploadSpeed.512000.upload.speed=512000

