Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.none=None
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.none.build.code_debug=0
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.error=Error
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.error.build.code_debug=1
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.warn=Warn
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.warn.build.code_debug=2
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.info=Info
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.info.build.code_debug=3
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.debug=Debug
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.debug.build.code_debug=4
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.verbose=Verbose
heltec_wifi_lora_32_V4_R8.menu.DebugLevel.verbose.build.code_debug=5

heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.3=REGION_US915
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.0=None
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.1=Freq
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wifi_lora_32_V4_R8.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wifi_lora_32_V4_R8.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wifi_lora_32_V4_R8.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wifi_lora_32_V4_R8.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wifi_lora_32_V4_R8.menu.LORA_FEM_TYPE.0=USE_KCT8103L_PA (default)
heltec_wifi_lora_32_V4_R8.menu.LORA_FEM_TYPE.0.build.LORA_FEM_TYPE=USE_KCT8103L_PA

heltec_wifi_lora_32_V4_R8.menu.LORA_RX_LNA.0=Disabled (default)
heltec_wifi_lora_32_V4_R8.menu.LORA_RX_LNA.0.build.LORA_RX_LNA=1
heltec_wifi_lora_32_V4_R8.menu.LORA_RX_LNA.1=Enabled
heltec_wifi_lora_32_V4_R8.menu.LORA_RX_LNA.1.build.LORA_RX_LNA=0

heltec_wifi_lora_32_V4_R8.menu.EraseFlash.none=Disabled
heltec_wifi_lora_32_V4_R8.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_lora_32_V4_R8.menu.EraseFlash.all=Enabled
heltec_wifi_lora_32_V4_R8.menu.EraseFlash.all.upload.erase_cmd=-e

heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.default=Disabled
heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.default.build.zigbee_mode=
heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.default.build.zigbee_libs=
heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
heltec_wifi_lora_32_V4_R8.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

heltec_rc32.name=Heltec RC32

heltec_rc32.vid.0=0x303a
heltec_rc32.pid.0=0x1001

heltec_rc32.bootloader.tool=esptool_py
heltec_rc32.bootloader.tool.default=esptool_py

heltec_rc32.upload.tool=esptool_py
heltec_rc32.upload.tool.default=esptool_py
heltec_rc32.upload.tool.network=esp_ota

heltec_rc32.upload.maximum_size=3342336
heltec_rc32.upload.maximum_data_size=327680
heltec_rc32.upload.flags=
heltec_rc32.upload.extra_flags=
heltec_rc32.upload.use_1200bps_touch=false
heltec_rc32.upload.wait_for_upload_port=false

heltec_rc32.serial.disableDTR=false
heltec_rc32.serial.disableRTS=false

heltec_rc32.build.tarch=xtensa
heltec_rc32.build.bootloader_addr=0x0
heltec_rc32.build.target=esp32s3
heltec_rc32.build.mcu=esp32s3
heltec_rc32.build.core=esp32
heltec_rc32.build.variant=heltec_rc32
heltec_rc32.build.board=HELTEC_RC32

heltec_rc32.build.usb_mode=1
heltec_rc32.build.cdc_on_boot=1
heltec_rc32.build.msc_on_boot=0
heltec_rc32.build.dfu_on_boot=0
heltec_rc32.build.f_cpu=240000000L
heltec_rc32.build.flash_size=16MB
heltec_rc32.build.flash_freq=80m
heltec_rc32.build.flash_mode=qio
heltec_rc32.build.boot=qio
heltec_rc32.build.boot_freq=80m
heltec_rc32.build.partitions=default_16MB
heltec_rc32.build.loop_core=
heltec_rc32.build.event_core=
heltec_rc32.build.psram_type=opi
heltec_rc32.build.memory_type={build.boot}_{build.psram_type}
heltec_rc32.build.psram=
heltec_rc32.build.defines=-D{build.band} -DMCU_ESP32_S3 -DHELTEC_BOARD=39 -DSLOW_CLK_TPYE=0 -DHELTEC_RC32  -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -DLORA_RX_LNA={build.LORA_RX_LNA} -D{build.LORA_FEM_TYPE} -D{build.board} {build.psram}
## IDE 2.0 Seems to not update the value
heltec_rc32.menu.JTAGAdapter.default=Disabled
heltec_rc32.menu.JTAGAdapter.default.build.copy_jtag_files=0
heltec_rc32.menu.JTAGAdapter.builtin=Integrated USB JTAG
heltec_rc32.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
heltec_rc32.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
heltec_rc32.menu.JTAGAdapter.external=FTDI Adapter
heltec_rc32.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
heltec_rc32.menu.JTAGAdapter.external.build.copy_jtag_files=1
heltec_rc32.menu.JTAGAdapter.bridge=ESP USB Bridge
heltec_rc32.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
heltec_rc32.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

